import { Container } from "react-bootstrap";
import "../styles/components/policy.css"

const PolicyPage = () => {
    return (
        <Container className="policy-text">
                <h2 className="text-center mb-4">Угода користувача</h2>
                <p>
                    Дана Угода користувача (далі також – «Угода») регулює
                    відносини з використання функцій Сайту та загальні умови
                    можливого надання Послуг між Виконавцем (далі також –
                    «Власник Сайту»), з одного боку, та фізичною або юридичною
                    особою Замовником, що прийняла умови цієї Угоди шляхом
                    приєднання до цієї Угоди в цілому і беззастережно (далі
                    також – «Користувач сайту»), з іншого боку, далі при
                    спільній згадці «Сторони», а окремо – «Сторона».
                </p>
                <p>
                    Ця Угода та відносини Сторін, що виникли з цієї Угоди,
                    регулюються законодавством.
                </p>
                <h5>
                    Загальні положення Угоди користувача У цьому документі та
                    зв'язаних з ним відносинах Сторін застосовуються такі
                    терміни та визначення:
                </h5>
                <ul style={{ listStyleType: "lower-alpha" }}>
                    <li>
                        Сайт Власника/ Сайт - інтернет-сайт, розміщені в домені
                        Власника сайту та його піддоменах.
                    </li>
                    <li>Угода - це угода з усіма доповненнями та змінами.</li>
                    <li>
                        Адміністрація/представник Сайту, Власника Сайту – особа
                        уповноважена Власником сайту на дії, передбачені Угодою.
                    </li>
                    <li>
                        Відвідувач - будь-яка особа, яка перейшла на Сайт і
                        знаходиться на ньому, використовуючи його властивості
                        для ознайомлення з контентом, розміщеним на Сайті.
                    </li>
                    <li>
                        Користувач — дієздатна фізична особа, що приєдналася до
                        цієї Угоди у власному інтересі або виступає від імені та
                        в інтересах юридичної особи, яку він представляє.
                        Будь-який відвідувач Сайту з власної волі може заповнити
                        надану для цього форму та стати Користувачем.
                    </li>
                </ul>
                <p>
                    Сайт містить інформацію та матеріали про товари та послуги,
                    які в подальшому можуть бути надані Користувачеві у разі
                    укладання реального Договору. Якщо якась фізична особа
                    зареєструвалася як Користувач від імені уповноваженої її на
                    те юридичної особи, це означає, що юридична особа приймає
                    Угоду в повному обсязі з наступними наслідками.
                </p>
                <p>
                    Зокрема, при використанні Сайту, Користувач не має права
                    видавати себе за іншу людину або представника організації
                    та/або спільноти без достатніх прав, у тому числі за
                    співробітників Сайту, а також застосовувати будь-які інші
                    форми та способи незаконного представництва інших осіб у
                    мережі Інтернет , а також вводити Користувачів, Сайт та його
                    представників в оману щодо властивостей та характеристик
                    будь-яких суб'єктів чи об'єктів.
                </p>
                <p>
                    У разі виявлення порушення прав та/або інтересів у зв'язку з
                    використанням Сайту, у тому числі іншим Користувачем, слід
                    повідомити про це Власника сайту, шляхом направлення
                    письмового повідомлення, повідомлення за телефоном з
                    докладним викладом обставин порушення та/або гіпертекстовим
                    посиланням на сторінку, що містить матеріали, якими
                    порушуються відповідні права та/або інтереси Сайту.
                </p>
                <h5>Інтелектуальні права</h5>
                <p>
                    Всі об'єкти, доступні за допомогою Сайту, включаючи елементи
                    дизайну, текст, графічні зображення, ілюстрації, відео,
                    комп'ютерні програми, бази даних, музика, звуки та інші
                    об'єкти, розміщені в рамках Сайту, є об'єктами виняткових
                    прав Сайту та інших правовласників. Сайт надає Користувачеві
                    право його функціонального використання у межах його
                    загальних функціональних можливостей.
                </p>
                <p>
                    Використання Сайту іншими способами, у тому числі шляхом
                    копіювання (відтворення) розміщеного на Сайті Контенту, а
                    також елементів дизайну, комп'ютерних програм і баз даних,
                    що входять до складу Сайту, їх декомпіляція, модифікація, і
                    подальше поширення, публічний показ, доведення до загальної
                    інформації, суворо заборонені, якщо інше не передбачено цією
                    Угодою та укладеними Договорами.
                </p>
                <p>
                    Користувач не має права відтворювати, повторювати та
                    копіювати, продавати, а також використовувати для будь-яких
                    комерційних цілей будь-які частини Сайту (включаючи Контент,
                    доступний Користувачеві за допомогою Додатків), або доступ
                    до них, крім тих випадків, коли Користувач отримав такий
                    дозвіл від Сайту/Власників Сайту, або коли це прямо
                    передбачено додатковими документами (Договорами, Додатками
                    тощо).
                </p>
                <p>
                    Використання Користувачем Сайту, а також розміщеного в ньому
                    Контенту для особистого некомерційного використання
                    допускається за умови дотримання всіх законів охорони
                    авторського права, суміжних прав, товарних знаків, інших
                    повідомлень про авторство, збереження імені (або псевдоніма)
                    автора/найменування правовласника у незмінному вигляді,
                    збережене відповідного об'єкта у незмінному вигляді. Виняток
                    становлять випадки, що прямо передбачені законодавством, що
                    регулює загальний захист даних або додатковими документами
                    на використання Сайту.
                </p>
                <p>
                    Сайт може містити посилання на сайти в Інтернеті (сайти
                    третіх осіб). Вказані треті особи та їх контент не
                    перевіряються Сайтом на відповідність тим чи іншим вимогам
                    (достовірності, повноти тощо). Сайт не несе відповідальності
                    за будь-яку інформацію, матеріали, розміщені на сайтах
                    третіх осіб, до яких Користувач отримує доступ.
                </p>
        </Container>
    );
};

export default PolicyPage;
